---
title: AssemblyDifferenceNamingCategory
classe: Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.AssemblyDifference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AssemblyDifferenceNamingCategory

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId NamingCategoryId1 { get; }` | `assemblyDifferenceNamingCategory.NamingCategoryId1` | ElementId |
| `ElementId NamingCategoryId2 { get; }` | `assemblyDifferenceNamingCategory.NamingCategoryId2` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```